In [1]:
import pymysql
import pandas as pd

host = '127.0.0.1'
port = "3306"
user = 'root'
password = ''
database = 'gudang'

conn = pymysql.connect(
    host=host,
    port=int(port),
    user=user,
    passwd=password,
    db=database,
    charset='utf8mb4')

def run(sql):
    df = pd.read_sql_query(sql,conn)
    return df

In [2]:
run("select * from products")

   id                     name  category_id
0   1                    Sampo            1
1   2               Sikat Gigi            1
2   3  Indonmie goreng spesial            2
3   4           mie sedap soto            2
4   5            rock mie baso            2
5   6                   Nugget            3

In [3]:
run("select * from categories")

   id             name
0   1  Peralatan Mandi
1   2       Mie Instan
2   3    Olahan Daging

# SOAL NOMOR 6

In [5]:
run("""
select c.id, c.name as category_name, GROUP_CONCAT(p.name ORDER BY p.name ASC SEPARATOR ', ') as product
from products p
inner join categories c on p.category_id = c.id
group by c.id, category_name
""")

   id    category_name                                            product
0   1  Peralatan Mandi                                  Sampo, Sikat Gigi
1   2       Mie Instan  Indonmie goreng spesial, mie sedap soto, rock ...
2   3    Olahan Daging                                             Nugget